# ZOffsetValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZOffsetValue Property
ParameterTypeId Class See Also
---
"z Offset Value"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZOffsetValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZOffsetValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZOffsetValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace